tum-esi/time-sync-testbed/iMXRT1050/middleware/lwip/port/ethernetif.c
    /* It is recommended to double check the TMODE field in the
     * TCSR register to be cleared before the first compare counter
     * is written into TCCR register. Just add a double check.
     */
    tmp_val = ethernetif->base->CHANNEL[tmr_ch].TCSR;
    do {
        tmp_val &= ~(ENET_TCSR_TMODE_MASK);
        ethernetif->base->CHANNEL[tmr_ch].TCSR = tmp_val;
        tmp_val = ethernetif->base->CHANNEL[tmr_ch].TCSR;
    } while (tmp_val & ENET_TCSR_TMODE_MASK);

    tmp_val = (ENET_NANOSECOND_ONE_SECOND >> 1);

    ENET_Ptp1588SetChannelCmpValue(ethernetif->base, tmr_ch, tmp_val);

    /* Calculate the second the compare event timestamp */
    next_counter = tmp_val;

    /* Compare channel setting. */
    ENET_Ptp1588ClearChannelStatus(ethernetif->base, tmr_ch);
    
    ENET_Ptp1588SetChannelOutputPulseWidth(ethernetif->base, tmr_ch, false, 31, true);
    
    /* Write the second compare event timestamp and calculate
     * the third timestamp. Refer the TCCR register detail in the spec.
     */
    ENET_Ptp1588SetChannelCmpValue(ethernetif->base, tmr_ch, next_counter);
    /* Update next counter */
    //next_counter = (next_counter + ETH_PTP_NSEC_PER_SEC) & ENET_TCCR_TCC_MASK;
    ethernetif->handle.ptpNextCounter = next_counter;

//    sys_mutex_unlock(&ptp_mutex);
}

static void ethernet_ptptime_init(struct ethernetif *ethernetif, uint32_t ptp_clk_freq,
                                   bool pps_en, enet_ptp_timer_channel_t tmr_ch)
{
    enet_ptp_config_t ptp_cfg;

    assert(ethernetif);
    ptp_ethernetif = ethernetif;

    /* Config 1588 */
    memset(&ptp_cfg, 0, sizeof(enet_ptp_config_t));
    ptp_cfg.channel = tmr_ch;
    ptp_cfg.ptpTsRxBuffNum = ENET_RXBD_NUM;
    ptp_cfg.ptpTsTxBuffNum = ENET_TXBD_NUM;
    ptp_cfg.rxPtpTsData = &g_rxPtpTsBuff[0];
    ptp_cfg.txPtpTsData = &g_txPtpTsBuff[0];
    ptp_cfg.ptp1588ClockSrc_Hz = ptp_clk_freq;
    ENET_Ptp1588Configure(ptp_ethernetif->base, &ptp_ethernetif->handle, &ptp_cfg);

    if (true == pps_en)
    {
        ethernet_ptptime_enablepps(ptp_ethernetif, tmr_ch);
    }
    else
    {
        ENET_Ptp1588SetChannelMode(ptp_ethernetif->base, tmr_ch, kENET_PtpChannelDisable, false);
    }
}



/*******************************************************************************
* Function Name  : ethernet_ptptime_adjfreq
* Description    : Updates timer correction Register and correction increment value
* Input          : Correction value in thousandth of ppm (incps*10^9)
* Output         : None
* Return         : None
*******************************************************************************/
void ethernet_ptptime_adjfreq(int32_t incps)
{
    int32_t neg_adj = 0;
    uint32_t corr_inc, corr_period;

    assert(ptp_ethernetif);

    /*
     * incps means the increment rate (nanseconds per second)by which to
     * slow down or speed up the slave timer.
     * Positive ppb need to speed up and negative value need to slow down.
    */

    if (0 == incps)
    {
        ptp_ethernetif->base->ATCOR &= ~ENET_ATCOR_COR_MASK; /* Reset PTP frequency */
        return;
    }
	
    if (incps < 0)
    {
        incps = -incps;
        neg_adj = 1;
    }

    corr_period = (uint32_t)PTP_CLOCK_FRE_RT/incps;

    /* neg_adj = 1, slow down timer, neg_adj = 0, speed up timer */
    corr_inc = (neg_adj) ? (PTP_AT_INC - 1) : (PTP_AT_INC + 1);	

    ENET_Ptp1588AdjustTimer(ptp_ethernetif->base, corr_inc, corr_period);

}

void ethernet_ptptime_adjtime(int32_t second, int32_t nano_second)
{
    enet_ptp_time_t tmp_ts;
    enet_ptp_time_t current_ts;
    int32_t tmp_adj_sec = 0, tmp_adj_nsec = 0;
    int32_t carry_flag = 0;

    assert(nano_second < ENET_NANOSECOND_ONE_SECOND);
    assert(nano_second > -ENET_NANOSECOND_ONE_SECOND);
    
    ethernet_ptptime_gettime(&current_ts);
    tmp_adj_nsec = current_ts.nanosecond - nano_second;
	tmp_adj_sec = current_ts.second - second;
	
    if (tmp_adj_nsec > ENET_NANOSECOND_ONE_SECOND)
    {
        tmp_adj_sec += 1;
        tmp_adj_nsec -= ENET_NANOSECOND_ONE_SECOND;
    }

	if (tmp_adj_sec > 0  && tmp_adj_nsec < 0)
    {
        carry_flag = - 1;
        tmp_adj_nsec += ENET_NANOSECOND_ONE_SECOND;
    } else if (tmp_adj_sec < 0  && tmp_adj_nsec > 0)
    {
        carry_flag = 1;
		tmp_adj_nsec -= ENET_NANOSECOND_ONE_SECOND;
    }
	
    tmp_adj_sec = current_ts.second + carry_flag;
    assert(tmp_adj_sec >= 0);
    assert(tmp_adj_nsec >= 0);

    tmp_ts.second = tmp_adj_sec;
    tmp_ts.nanosecond = tmp_adj_nsec;
    ethernet_ptptime_settime(&tmp_ts);
}

/*******************************************************************************
* Function Name  : ethernet_ptptime_settime
* Description    : Initialize time base
* Input          : Time with sign
* Output         : None
* Return         : None
*******************************************************************************/
void ethernet_ptptime_settime(enet_ptp_time_t *timestamp)
{
    assert(ptp_ethernetif);

    ENET_Ptp1588SetTimer(ptp_ethernetif->base, &(ptp_ethernetif->handle), timestamp);

//    ethernet_ptptime_enablepps(ptp_ethernetif, ETH_PTP_DEFAULT_PPS_CHANNEL);
}

void ethernet_ptptime_gettime(enet_ptp_time_t *timestamp)
{
    assert(ptp_ethernetif);

    ENET_Ptp1588GetTimer(ptp_ethernetif->base, &ptp_ethernetif->handle, timestamp);
}

err_t enet_get_rxframe_time(enet_ptp_time_data_t *ptpTimeData)
{
	if(ENET_GetRxFrameTime(&ptp_ethernetif->handle, ptpTimeData) == kStatus_Success)
	{
		return ERR_OK;
	}
	
	return ERR_ARG;
}
err_t enet_get_txframe_time(enet_ptp_time_data_t *ptpTimeData)
{
	if(ENET_GetTxFrameTime(&ptp_ethernetif->handle, ptpTimeData) == kStatus_Success)
	{
		return ERR_OK;
	}
	
	return ERR_ARG;
}

#endif /* LWIP_PTP */


#if USE_RTOS && defined(FSL_RTOS_FREE_RTOS)
#if defined(FSL_FEATURE_SOC_ENET_COUNT) && (FSL_FEATURE_SOC_ENET_COUNT > 0)
#if FSL_FEATURE_ENET_QUEUE > 1
static void ethernet_callback(ENET_Type *base, enet_handle_t *handle, uint32_t ringId, enet_event_t event, void *param)
#else
static void ethernet_callback(ENET_Type *base, enet_handle_t *handle, enet_event_t event, void *param)
#endif /* FSL_FEATURE_ENET_QUEUE */
#elif defined(FSL_FEATURE_SOC_LPC_ENET_COUNT) && (FSL_FEATURE_SOC_LPC_ENET_COUNT > 0)
static void ethernet_callback(ENET_Type *base, enet_handle_t *handle, enet_event_t event, uint8_t channel, void *param)
#endif /* FSL_FEATURE_SOC_*_ENET_COUNT */
{
    struct netif *netif = (struct netif *)param;
    struct ethernetif *ethernetif = netif->state;
    BaseType_t xResult;
    

